/*สมมติว่าภาษีเงินได้ของบุคคลทั่วไปถูกแบ่งออกเป็นสี่กลุ่มคือ  กลุ่มที่ไม่ต้องเสียภาษี (A),  กลุ่มที่เสียภาษี 7% (B),  กลุ่มที่เสียภาษี 20% (C) และ  กลุ่มที่เสียภาษี 30% (D)
โดยเกณฑ์การคิดภาษีจะคิดจากรายได้สุทธิต่อเดือน คือ รายได้ต่อเดือนหลังหักรายการที่ใช้ลดหย่อนภาษีต่อเดือน

เมื่อได้รายได้สุทธิมาแล้วการแบ่งกลุ่มภาษีก็จะถูกดำเนินการต่อไปตาม เกณฑ์ต่อไปนี้
      ถ้ารายได้สุทธิน้อยกว่า 0 บาทต่อปี ให้แสดงคำว่า "ERROR" และ จบโปรแกรม
      ถ้ารายได้สุทธิถึง 0 บาทต่อปี แต่น้อยกว่า 200,000 บาท บาทต่อปี ไม่ต้องเสียภาษีเงินได้
      ถ้ารายได้สุทธิถึง 200,000 บาทต่อปี แต่น้อยกว่า 500,000 บาท จะเสียภาษีเงินได้ 7%
      ถ้ารายได้สุทธิถึง 500,000 บาทต่อปี แต่น้อยกว่า 1,000,000 บาท จะเสียภาษีเงินได้ 20%
      ถ้ารายได้สุทธิตั้งแต่ 1,000,000 บาทต่อปีขึ้นไป จะเสียภาษีเงินได้ 30%*/

#include<stdio.h>



int main(){

}
