#include<stdio.h>
main(){

    int o = 0, e = 0;//ประกาศตัวแปรนับจำนวน

    int num;
    scanf("%d", &num);//รับค่าnumเพื่อตรวจสอบเงื่อนไขครั้งเเรก
    while(num != 0){//เงื่อนไขในการหยุดการทำงาน
        if(num % 2 == 0){//เงื่อนไขในการตรวจสอบเลขคู่
            e++;
        }else {//เลขคี่
            o++;
        }
        scanf("%d", &num);//รับค่าnumเพื่่อตรวจสอบเงื่อนไขอีกครั้ง
    }

    printf("Even number = %d\n", e);//เเสดงผลเลขคู่
    printf("Odd number  = %d\n", o);//เเสดงผลเลขคี่

}
